In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("sample_employees.csv")

In [4]:
df.head(10)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [5]:
df.columns.tolist()

['id', 'name', 'department', 'salary', 'age', 'city']

In [7]:
df.shape

(7, 6)

In [9]:
df['department'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [10]:
df.isna().sum()

id            0
name          0
department    0
salary        1
age           1
city          0
dtype: int64

In [17]:
df1 = df[['age', 'salary']].mean()

In [16]:
df[['age', 'salary']].fillna(df1, inplace=True)
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_12120\1991877291.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['age', 'salary']].fillna(df1, inplace=True)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [22]:
df['salary'].fillna(df['salary'].mean(), inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_12120\3850147431.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(), inplace=True)

In [23]:
df

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance  60000.0  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [24]:
df['age'].fillna(df['age'].mean(),inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_12120\1492264711.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)

In [25]:
df

   id     name department   salary        age       city
0   1    Alice         HR  50000.0  25.000000      Delhi
1   2      Bob         IT  60000.0  30.000000     Mumbai
2   3  Charlie         IT  70000.0  35.000000      Delhi
3   4    David    Finance  60000.0  40.000000  Bangalore
4   5      Eva         HR  55000.0  31.333333      Delhi
5   6    Frank    Finance  65000.0  28.000000     Mumbai
6   7    Grace         IT  60000.0  30.000000     Mumbai

In [26]:
df['salary_age']=df['salary']*df['age']

In [27]:
df

   id     name department   salary        age       city    salary_age
0   1    Alice         HR  50000.0  25.000000      Delhi  1.250000e+06
1   2      Bob         IT  60000.0  30.000000     Mumbai  1.800000e+06
2   3  Charlie         IT  70000.0  35.000000      Delhi  2.450000e+06
3   4    David    Finance  60000.0  40.000000  Bangalore  2.400000e+06
4   5      Eva         HR  55000.0  31.333333      Delhi  1.723333e+06
5   6    Frank    Finance  65000.0  28.000000     Mumbai  1.820000e+06
6   7    Grace         IT  60000.0  30.000000     Mumbai  1.800000e+06